Revit 2026 API

# VertexFormat Methods

---

The VertexFormat type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValid | Tests whether the vertex format specification is valid for rendering. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

VertexFormat Class

Autodesk.Revit.DB.DirectContext3D Namespace